//#include<stdio.h>
//int main()
//{
//	/*
//		给定整数 n ，获取所有小于等于n的质数的数量
//			示例：
//				输入：n = 180
//				输出：25
//		质数：只能被1和本身整除的数字
//
//		1.判断一个整数是否是一个质数
//		2.添加范围 1~100
//		3.统计
//	
//	*/
//
//	//1.判断一个整数是否是一个质数
//	//定义变量记录整数
//	int number = 33;
//
//	//统计从2开始，到number-1,在这个范围之内，有多少个数字能被number整除
//	int count = 0;
//	for (int i = 2; i < number; i++)
//	{
//		if (number % i == 0)
//		{
//			//找到了一个数字能被number整除
//			count++;
//			//后面其他的数字就没有必要再次判断了
//			break;
//		}
//
//	}
//
//	//对count进行判断
//	if (count == 0)
//	{
//		printf("%d是一个质数\n", number);
//	}
//	else
//	{
//		printf("%d不是一个质数\n", number);
//	}
//
//	printf("\n");
//
//	//2.添加范围 1~100
//	for (int x = 2; x <= 100; x++)
//	{
//		//x:依次表示2~100之间的每一个数字
//
//		//统计从2开始，到x-1,在这个范围之内，有多少个数字能被x整除
//		int count1 = 0;
//		for (int y = 2; y < x; y++)
//		{
//			if (x % y == 0)
//			{
//				//找到了一个数字能被x整除
//				count1++;
//				//后面其他的数字就没有必要再次判断了
//				break;
//			}
//
//		}
//
//		//对count1进行判断
//		if (count1 == 0)
//		{
//			printf("%d是一个质数\n", x);
//		}
//		else
//		{
//			printf("%d不是一个质数\n", x);
//		}
//
//
//	}
//
//	printf("\n");
//
//	//3.统计
//	//定义一个变量，用来统计2~100之间一共有多少个质数
//	int countA = 0;
//
//	for (int x1 = 2; x1 <= 100; x1++)
//	{
//		//x1:依次表示2~100之间的每一个数字
//
//		//统计从2开始，到x1-1,在这个范围之内，有多少个数字能被x1整除
//		int count1 = 0;
//		for (int y1 = 2; y1 < x1; y1++)
//		{
//			if (x1 % y1 == 0)
//			{
//				//找到了一个数字能被x整除
//				count1++;
//				//后面其他的数字就没有必要再次判断了
//				break;
//			}
//
//		}
//
//		//对count1进行判断
//		if (count1 == 0)
//		{
//			countA++;
//		}
//		
//	}
//
//	//打印countA
//	printf("%d\n", countA);
//
//
//	return 0;
//}