//#include<stdio.h>
//int main()
//{
//	/*
//		找出0~1000之内，符合要求的数字：
//		要求：每一位的数字之和等于15
//
//		套路：
//			1.外循环：获取范围中的每一个数字 0~1000
//				i: 0~1000
//			2.内循环：处理这个数字
//					每一位的数字之和等于15
//	
//	*/
//
//	int i, num, sum, digit;
//	printf("0~1000之间各位数字之和等于15的数字有：\n");
//	for (i = 0; i <= 1000; i++)
//	{
//		num = i;
//		sum = 0;
//		//计算每一位数字之和
//		while (num > 0)
//		{
//			digit = num % 10;
//			sum += digit;
//			num /= 10;
//		}
//		//注意：i=0时 sum=0, 不满足；i=1000时 sum=1,不满足
//		if (sum == 15)
//		{
//			printf("%d\n", i);
//		}
//
//	}
//	printf("\n");
//
//
//	return 0;
//}