//#include<stdio.h>
//int main()
//{
//	/*需求：
//		男子上门提亲，
//		如果姑娘满意，会说：“终身大事全凭父母做主。”
//		如果不满意，会说：“女儿还想孝敬父母两年。”
//	
//		格式：
//			if (判断）
//			{
//				语句体a;
//			}
//			else
//			{
//				语句体b;
//			}
//	*/
//
//	//1.定义一个变量用来表示姑娘是否满意
//	int satisfy = 1;
//	//2.判断
//	if (satisfy)
//	{
//		printf("终生大事全凭父母做主。\n");
//	}
//	else
//	{
//		printf("女儿还想孝敬父母两年。\n");
//	}
//
//	/*需求：
//		定义一个整数表示我心爱的姑娘对我的好感度。
//		如果大于0，就同意我的表白。
//		否则，我就去表白别人了
//	*/
//	//1.定义一个变量用来表示姑娘的好感度
//	int love = 60;
//	//2.判断
//	if (love >= 60)
//	{
//		printf("同意我的表白\n");
//	}
//	else
//	{
//		printf("表白别人\n");
//	}
//
//	/*需求：
//		我跟小诗诗一起去看电影
//		如果在同一排而且连着坐，我会开心的看电影
//		如果不是在同一排或者没有连着坐，我会开心的打游戏
//	*/
//	//1.定义个变量分别表示两张电影票
//	int rowa = 5;
//	int numbera = 6;
//	int rowb = 5;
//	int numberb = 7;
//	//2.判断
//	//如果在同一排而且连着坐，我会开心的看电影
//	//同一排：rowa == rowb
//	//连着坐：numbera - numberb   1  -1
//	//如果不是在同一排或者没有连着坐，我会开心的打游戏
//	if ((rowa == rowb) && (numbera - numberb == 1 || numbera - numberb == -1))
//	{
//		printf("我会开心的看电影\n");
//	}
//	else
//	{
//		printf("我会开心的打游戏\n");
//	}
//
//	/*需求：
//		键盘录入游戏氪金的总额度，不同的额度vip等级也不一样
//		1~99元：尊贵的vip1
//		100~499元：尊贵的vip2
//		500~999元：尊贵的vip3
//		1000~1999元：尊贵的vip4
//		2000~5000元：尊贵的vip5
//	*/
//	//1.键盘录入游戏氪金的总额度
//	int money;
//	printf("请输入您在游戏中的氪金总金额\n");
//	scanf_s("%d", &money);
//	//2.判断游戏中氪金的总额度
//	if (money >= 1 && money <= 99)
//	{
//		printf("尊贵的vip1\n");
//	}
//	else if (money >= 100 && money <= 499)
//	{
//		printf("尊贵的vip2\n");
//	}
//	else if (money >= 500 && money <= 999)
//	{
//		printf("尊贵的vip3\n");
//	}
//	else if (money >= 1000 && money <= 1999)
//	{
//		printf("尊贵的vip4\n");
//	}
//	else if (money >= 2000 && money <= 5000)
//	{
//		printf("顶级的vip5\n");
//	}
//	else
//	{
//		//超过5000的情况
//		printf("顶级的vip5\n");
//	}
//
//	return 0;
//}