//#include<stdio.h>
//
//int main()
//{
//	//输出常量
//	//1.输出整数
//	printf("%d\n", 18);
//	//2.输出小数
//	printf("%f\n", 1.93);
//	//3.输出字符
//	printf("%c\n", 'a');
//	//4.输出字符串
//	//第一种方式：
//	printf("hello world!\n");
//	//第二种方式：
//	printf("我的名字:%s\n", "小可");
//
//	//练习1：打印学校的名字
//	printf("我学校的名字:%s","职业技术学院\n");
//	//练习2：打印高考的成绩
//	printf("我高考的总分为：%f分\n", 666.0);
//	//练习3：输出多个常量
//	//我的女朋友的姓名是：小思思。性别：女。年龄：18岁。身高：1.82米。体重：110斤。
//	//要求：女朋友的姓名，性别，年龄，身高，体重，等信息需要结合占位符的形式进行输出
//	printf("我的女朋友的姓名是：%s。性别：%s。年龄：%d岁。身高：%f米。体重：%d斤。", "小思思", "女", 18, 1.82, 110);
//	//练习4：输出并换行
//	//我的女朋友的姓名是：小思思。性别：女。年龄：18岁。身高：1.82米。体重：110斤。
//	//要求1：女朋友的姓名，性别，年龄，身高，体重，等信息需要结合占位符的形式进行输出
//	//要求2：每个数据单独成一行
//	printf("我的女朋友的姓名是：%s\n", "小思思");
//	printf("性别：%s\n", "女");
//	printf("年龄：%d岁\n", 18);
//	printf("身高：%f米\n", 1.82);
//	printf("体重：%d斤\n", 110);
//	return 0;
//}