//#include<stdio.h>
//int main()
//{
//	/*
//	需求1：键盘录入女朋友的名字，并按照以下格式打印出来
//	格式：我亲亲女朋友的名字为：XXX
//	字符串变量的定义方式：
//		数据类型 变量名[大小] = 字符串
//		char str[内存占用大小] = "aaa";
//	内存占用大小的计算方式：
//		英文：1个字母，符号，数字占用一个字节
//		中文：在vs或者vc中，默认情况下，一个中文占用两个字节
//		结束标记：1个字节
//	
//	*/
//	//1.定义变量
//	/*char str[4] = "aaa";
//	printf("%s\n", str);
//	printf("%zu\n", sizeof(str));
//	printf("%zu\n", sizeof("aaa"));*/
//
//	//定义变量记录女朋友的名字
//	char str[100];
//	//键盘录入女朋友的名字
//	printf("请输入您女朋友的名字:\n");
//	scanf("%s", &str);
//	//输出打印
//	printf("我亲亲女朋友的名字为：%s", str);
//
//
//}