//#include<stdio.h>
//int main()
//{
//	//除法（/）
//	printf("%d\n", 10 / 2);
//
//	//取余（%）
//	printf("%d\n", 10 % 2);
//	printf("%d\n", 10 % 3);
//
//	//通用细节：
//	//1.整数计算，结果一定是整数
//	printf("%d\n", 3 + 2);
//	printf("%d\n", 10 / 3);
//
//	//2.小数计算，结果一定是小数
//	printf("%lf\n", 10.2 + 3.0);
//
//	//3.整数和小数计算，结果一定是小数
//	printf("%lf\n", 10 / 3.0);
//
//	//4.小数直接参与计算，结果是有可能不精确的
//	printf("%lf\n", 3.333333333333333 + 6.666666666666666);
//	printf("%.20lf\n", 10.0 / 3.0);
//
//	//除法的细节
//	//1.不能除以0
//	//printf("%d\n", 10 / 0);
//
//	//取余的细节
//	//1.运算的数据必须全部都是整数
//	printf("%d\n", 10 % 3);
//
//	//2.获取余数的正负，是跟第一个数字保持一致的
//	printf("%d\n", 10 % 3);  //1
//	printf("%d\n", -10 % 3); //-1
//	printf("%d\n", 10 % -3); //1
//
//	//3不能除以0
//}