//#include<stdio.h>
//int main()
//{
//	int i = 10;
//	int j = 5;
//	int k = i++ + ++i - --j - i--;
//	//windows:
//	//       11 + 11  -  4  -  11 = 7
//	//mac:
//	//       10 + 12  -  4  -  12 = 6
//	printf("%d\n", k);
//
//
//	//windows:7
//	//前缀优于后缀
//	//前缀统一自增/自减，再把结果拿出来用
//	//int i = 10;
//	//++i + ++i;
//	//12  +  12 = 24
//	//后缀统一先用，等整个表达式中变量用完了，再进行自增
//	//int i = 10;
//	//i++ + i++;
//
//	//mac、Linux:6
//	//前缀和后缀的优先级是一样的
//	//从左到右依次计算
//	//每一个前缀和后缀都是一个独立的个体
//	//int i = 10;
//	//++i + ++i;
//	//11  + 12 = 23
//
//	return  0;
//}