//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//1:真  0:假
//	printf("%d\n", a == b);
//	printf("%d\n", a != b);
//	printf("%d\n", a > b);
//	printf("%d\n", a >= b);
//	printf("%d\n", a < b);
//	printf("%d\n", a <= b);
//	printf("----\n");
//
//	//思考1：数学计算中，判断一个数是否为偶数，使用哪个关系运算符？
//	int c = 11;
//	printf("%d\n", c % 2 == 0);
//	//思考2：数学计算中，判断一个数是否不超过100，使用哪个关系运算符？
//	int number = 103;
//	printf("%d\n", number <= 100);
//	//思考3：电商项目的支付功能业务，需要判断银行卡余额是否足够，使用哪个关系运算符？
//	//需要支付的钱 <= 银行卡的余额
//	//银行卡的余额 >= 需要支付的钱
//	int pay = 100;
//	int money = 200;
//	printf("%d\n", pay <= money);
//	//思考4：电商项目的购买商品业务，需要判断货物的库存是否足够，使用哪个关系运算符？
//	//购买商品的数量
//	//库存
//	int buy = 10;
//	int ware = 100;
//	printf("%d\n", ware >= buy);
//	//思考5：点餐项目的筛选商品业务，需要点不低于100元的，使用哪个关系运算符？
//	int goods = 1000;  //商品的价格
//	printf("%d\n", goods >= 100);
//	
//	return 0;
//}