//#include<stdio.h>
//int main()
// {
//	/*需求1：键盘录入一个两位整数，要求该数字不能包含7。
//	如果符合要求，输出1，不符合要求输出0*/
//	//1.键盘录入一个两位整数
//	int number;
//	printf("请输入一个两位数：\n");
//	scanf("%d", &number);
//	/*printf("%d\n", number);*/
//
//	//2.要求该数字不能包含7
//	//个位不能是7，十位也不能是7
//	int ge = number % 10;
//	int shi = number / 10 % 10;
//
//	//判断
//	printf("%d\n", ge != 7 && shi != 7);
//
//	printf("----\n");
//
//	/*需求2：键盘录入一个两位整数，要求该数字不能包含7，而且不能是7的倍数。
//	如果符合要求，输出1，不符合要求输出0*/
//	//1.键盘录入一个两位整数
//	int number2;
//	printf("请输入一个两位数：\n");
//	scanf("%d", &number2);
//	
//	//2.要求该数字不能包含7
//	//个位不能是7，十位也不能是7
//	int ge2 = number2 % 10;
//	int shi2 = number2 / 10 % 10;
//
//	//判断
//	//&& || 可以连续写多个
//	//多个&&，表示同时满足多个条件
//	//多个||，表示在多个条件当中，只要满足其中一个
//	printf("%d\n", ge2 != 7 && shi2 != 7 && number2 %7 != 0);
//
//	int a = 1, b = 5;
//	a > 0 && ++b;
//	printf("a=%d,b=%d\n", a, b);
//
//	int a1 = 1, b1 = 5;
//	a1 > 10 && ++b1;
//	printf("x=%d,y=%d\n", a1, b1);
//	return 0;
//}